{
	"module": "keras",
	"class_name": "Sequential",
	"config": {
		"name": "sequential",
		"trainable": true,
		"dtype": "mixed_float16",
		"layers": [
			{
				"module": "keras.layers",
				"class_name": "InputLayer",
				"config": {
					"batch_shape": [null, 256, 256, 3],
					"dtype": "float32",
					"sparse": false,
					"name": "input_layer"
				},
				"registered_name": null
			},
			{
				"module": "keras.layers",
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d",
					"trainable": true,
					"dtype": "mixed_float16",
					"filters": 64,
					"kernel_size": [3, 3],
					"strides": [1, 1],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [1, 1],
					"groups": 1,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 256, 256, 3] }
			},
			{
				"module": "keras.layers",
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d",
					"trainable": true,
					"dtype": "mixed_float16",
					"pool_size": [2, 2],
					"padding": "valid",
					"strides": [2, 2],
					"data_format": "channels_last"
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 254, 254, 64] }
			},
			{
				"module": "keras.layers",
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_1",
					"trainable": true,
					"dtype": "mixed_float16",
					"filters": 128,
					"kernel_size": [3, 3],
					"strides": [1, 1],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [1, 1],
					"groups": 1,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 127, 127, 64] }
			},
			{
				"module": "keras.layers",
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d_1",
					"trainable": true,
					"dtype": "mixed_float16",
					"pool_size": [2, 2],
					"padding": "valid",
					"strides": [2, 2],
					"data_format": "channels_last"
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 125, 125, 128] }
			},
			{
				"module": "keras.layers",
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_2",
					"trainable": true,
					"dtype": "mixed_float16",
					"filters": 256,
					"kernel_size": [3, 3],
					"strides": [1, 1],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [1, 1],
					"groups": 1,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 62, 62, 128] }
			},
			{
				"module": "keras.layers",
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d_2",
					"trainable": true,
					"dtype": "mixed_float16",
					"pool_size": [2, 2],
					"padding": "valid",
					"strides": [2, 2],
					"data_format": "channels_last"
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 60, 60, 256] }
			},
			{
				"module": "keras.layers",
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_3",
					"trainable": true,
					"dtype": "mixed_float16",
					"filters": 512,
					"kernel_size": [3, 3],
					"strides": [1, 1],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [1, 1],
					"groups": 1,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 30, 30, 256] }
			},
			{
				"module": "keras.layers",
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d_3",
					"trainable": true,
					"dtype": "mixed_float16",
					"pool_size": [2, 2],
					"padding": "valid",
					"strides": [2, 2],
					"data_format": "channels_last"
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 28, 28, 512] }
			},
			{
				"module": "keras.layers",
				"class_name": "Flatten",
				"config": {
					"name": "flatten",
					"trainable": true,
					"dtype": "mixed_float16",
					"data_format": "channels_last"
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 14, 14, 512] }
			},
			{
				"module": "keras.layers",
				"class_name": "Dense",
				"config": {
					"name": "dense",
					"trainable": true,
					"dtype": "mixed_float16",
					"units": 128,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 100352] }
			},
			{
				"module": "keras.layers",
				"class_name": "Dense",
				"config": {
					"name": "dense_1",
					"trainable": true,
					"dtype": "mixed_float16",
					"units": 64,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 128] }
			},
			{
				"module": "keras.layers",
				"class_name": "Dense",
				"config": {
					"name": "dense_2",
					"trainable": true,
					"dtype": "mixed_float16",
					"units": 32,
					"activation": "relu",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 64] }
			},
			{
				"module": "keras.layers",
				"class_name": "Dense",
				"config": {
					"name": "dense_3",
					"trainable": true,
					"dtype": "mixed_float16",
					"units": 1,
					"activation": "sigmoid",
					"use_bias": true,
					"kernel_initializer": {
						"module": "keras.initializers",
						"class_name": "GlorotUniform",
						"config": { "seed": null },
						"registered_name": null
					},
					"bias_initializer": {
						"module": "keras.initializers",
						"class_name": "Zeros",
						"config": {},
						"registered_name": null
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"registered_name": null,
				"build_config": { "input_shape": [null, 32] }
			}
		],
		"build_input_shape": [null, 256, 256, 3]
	},
	"registered_name": null,
	"build_config": { "input_shape": [null, 256, 256, 3] },
	"compile_config": {
		"loss": "binary_crossentropy",
		"loss_weights": null,
		"metrics": ["accuracy"],
		"weighted_metrics": null,
		"run_eagerly": false,
		"steps_per_execution": 1,
		"jit_compile": true
	}
}
